#include <REGX52.H>


void Timer0_Init(void)		//1毫秒@11.0592MHz
{
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x18;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0=1;
	EA=1;
	PT0=0;
}




// 中断模板

//void timer0_Routine() interrupt 1
//{
//	/* 触发了中断，现在需要重新设置寄存器的值让他可以再次循环 */
//	TH0		= 64535 / 256;	// 取高位，教程这里使用除法，其实，对于二的整数次幂不妨考虑移位
//	TL0		= 54535 % 256; 	// 取低位
//	T0Count++;
//	if(T0Count >= 1000)
//	{
//		T0Count = 0;
//		P2_0 = ~P2_0;		// 让状态取反
//	}
//	
//	
//}